[
    {
        "imageSrc": "s3/blog/images/learn-code.webp",
        "category": "Programming",
        "date": "February 3, 2023",
        "title": "Unlock the Fun Side of Programming: 10 Games That Will Help You Learn to Code",
        "description": "Do you want to learn how to code in a fun and engaging way? Many people associate coding with being boring and time-consuming, but the truth is that it can be a pleasurable experience. Learning to program or code can become a rewarding hobby with the right tools and games. This article will cover ten games that will help you discover the fun side of programming. After reading this article, you can decide which one is right for you. So prepare to have a good time while learning to code!",
        "url": "https://levelup.gitconnected.com/unlock-the-fun-side-of-programming-10-games-that-will-help-you-learn-to-code-ab0aa03a6a38"
    },
    {
        "imageSrc": "s3/blog/images/client-js.webp",
        "category": "JavaScript",
        "date": "January 28, 2023",
        "title": "Maximize Your Website’s Performance with Javascript Client-Side Storage",
        "description": "Client-side storage in JavaScript is a powerful tool for creating dynamic, interactive web pages that can store data on the user’s computer. With client-side storage, JavaScript applications have the ability to store data locally within a browser rather than sending it back and forth between a server and the browser each time an action takes place. This allows websites to create more responsive experiences as they can quickly retrieve stored information without additional requests or refreshes.",
        "url": "https://medium.com/geekculture/maximize-your-websites-performance-with-javascript-client-side-storage-792c1231a844"
    },
    {
        "imageSrc": "s3/blog/images/ai-based.webp",
        "category": "AI",
        "date": "January 24, 2023",
        "title": "Supercharge Your Productivity — Get Ahead with These Essential AI-Based Tools",
        "description": "AI-based tools can help you supercharge your productivity and get ahead in the modern world. From apps that manage your schedule and remind you of deadlines to AI-based customer support tools, there are plenty of AI-based tools available to help you stay organized and on top of your game. For example, AI-based customer support tools can help you quickly and efficiently provide support to customers, freeing up your time to focus on other tasks. Additionally, AI-based calendar tools can help you stay organized and on top of deadlines, while task management tools can help you prioritize tasks and ensure that you are focusing on the most important tasks first. AI-based tools can also help you automate mundane tasks so that you can focus on more creative and meaningful tasks.",
        "url": "https://levelup.gitconnected.com/supercharge-your-productivity-get-ahead-with-these-essential-ai-based-tools-caec1ecfcadd"
    },
    {
        "imageSrc": "s3/blog/images/js-cheatsheet.webp",
        "category": "JavaScript",
        "date": "January 20, 2023",
        "title": "The Ultimate JavaScript Array Methods Cheatsheet",
        "description": "JavaScript is one of the most popular programming languages in use today and is a fundamental technology for web development. It is primarily used to create interactive and dynamic websites. In JavaScript, an array is a special kind of object that stores a collection of values. Arrays are used to store multiple values in a single variable and can be useful for working with lists of data, such as items in a shopping cart or the results of a database query.",
        "url": "https://javascript.plainenglish.io/the-ultimate-javascript-array-methods-cheatsheet-73d95f599fab"
    },
    {
        "imageSrc": "s3/blog/images/qr-excel.webp",
        "category": "Spreadsheet",
        "date": "January 13, 2023",
        "title": "Generate QR codes using Excel and Google Sheets",
        "description": "QR Code (Quick Response Code) is the newest trend or tactic, and it is becoming more effective than ever. Touchless, frictionless marketing and eCommerce are becoming increasingly popular. The QR code can be easily read/scanned using smartphones. Many businesses now use QR codes for contactless sign-in, ordering food in restaurants, and other purposes. A QR code is made up of black squares arranged in a square grid on a white background that can be read by a camera of smartphone. It was created to enable fast decoding speeds, hence the name quick response code.",
        "url": "https://medium.com/webisora/generate-qr-codes-using-excel-and-google-sheets-8c9bd7e173af"
    },
    {
        "imageSrc": "s3/blog/images/yup_image.webp",
        "category": "JavaScript",
        "date": "January 10, 2023",
        "title": "Yup: Validating file type and size",
        "description": "Yup is a JavaScript object schema validator and object parser. To check if the file uploaded is of the correct type and not exceeding the maximum file size allowed to upload using Yup, you can do:",
        "url": "https://medium.com/@sagar-shrestha/yup-validating-file-type-and-size-81cd26ca7dfb"
    },
    {
        "imageSrc": "s3/blog/images/console_js.webp",
        "category": "JavaScript",
        "date": "December 31, 2022",
        "title": "Console object methods in JavaScript",
        "description": "The console object in JavaScript provides access to the browser’s debugging console. It is used for debugging purposes and logging results or errors. It is a global object and can be accessed with window.console or just console . A demo is available at the end of this page.",
        "url": "https://medium.com/gitconnected/console-object-methods-in-javascript-2ceae5913970"
    },
    {
        "imageSrc": "s3/blog/images/js_hacks.webp",
        "category": "JavaScript",
        "date": "December 21, 2022",
        "title": "A few JavaScript hacks",
        "description": "JavaScript is the most popular programming language, one of the Web's core technologies, alongside HTML and CSS. It is easy to learn and can be used for client-side and server-side developments. Here are a few JavaScript (JS) hacks to improve your code while making it more efficient.",
        "url": "https://medium.com/gitconnected/a-few-javascript-hacks-cf2b11df84ca"
    },
    {
        "imageSrc": "s3/blog/images/metamask.webp",
        "category": "Cryptocurrency",
        "date": "August 30, 2021",
        "title": "How to connect MetaMask to any network",
        "description": "MetaMask is a cryptocurrency wallet that you can use to interact with Ethereum Blockchain. It provides a user-friendly bridge between your web browser and the Ethereum blockchain, which is the host network for many dApps. Users can store Ether or any other ERC-20 token that was built using the Ethereum network and then use that cryptocurrency with the dApp of their choice.",
        "url": "https://levelup.gitconnected.com/how-to-connect-metamask-to-any-network-9805f42c687f"
    },
    {
        "imageSrc": "s3/blog/images/earn-crypto.webp",
        "category": "Cryptocurrency",
        "date": "August 3, 2020",
        "title": "A few ways to earn Cryptocurrency at no cost",
        "description": "A lot of cryptocurrency projects are quite unknown. This means that even useful and functioning projects are underused. To increase awareness, free coins are given out or rewarded after you complete the quiz or tasks. This way everyone will get to know about the crypto coin and the project.",
        "url": "https://levelup.gitconnected.com/few-ways-to-earn-crypto-currency-at-no-cost-4199b6eac917"
    },
    {
        "imageSrc": "s3/blog/images/aws-cheatsheet.webp",
        "category": "AWS",
        "date": "August 1, 2020",
        "title": "Amazon Web Services (AWS) Cheat Sheet",
        "description": "Cloud computing is an internet-based computing service to store and access data. It doesn’t store any data on the hard disk or local storage device. It saves them to a remote database.",
        "url": "https://levelup.gitconnected.com/amazon-web-services-aws-cheat-sheet-f1bddd736d0a"
    },
    {
        "imageSrc": "s3/blog/images/qrcode.webp",
        "category": "JavaScript",
        "date": "May 4, 2021",
        "title": "Few Ways to Generate QR Code Using JavaScript",
        "description": "QR Code (Quick Response Code) is the hottest trend or tactic and is getting better than ever. There is a new demand for touchless, frictionless marketing and eCommerce. Using smartphones you can easily read/scan the QR code. Many businesses are now using QR codes for contactless sign-in, ordering food in restaurants, etc. There are many ways to generate QR Codes and many third-party libraries that will help you do that.",
        "url": "https://medium.com/geekculture/few-ways-to-generate-qr-code-using-javascript-54b6b5220c4f"
    },
    {
        "imageSrc": "s3/blog/images/nginx.webp",
        "category": "NGINX",
        "date": "April 6, 2021",
        "title": "Auto maintenance mode with Nginx",
        "description": "Showing maintenance page in your site or web application when you are deploying new features or doing some maintenance work or during the downtime will ensure the visitor of the site (especially non-technical user) is actually down for proper maintenance. It is not a good idea to show some random or default error page that your server provides.",
        "url": "https://levelup.gitconnected.com/auto-maintenance-mode-with-nginx-71ef5c896851"
    },
    {
        "imageSrc": "s3/blog/images/react-table.webp",
        "category": "React, Web Development",
        "date": "March 11, 2021",
        "title": "Migrating React table from v6 to v7",
        "description": "React Table is a lightweight, fast and extendable datagrid package for React. The newest version i.e. v7 is a headless utility, which means that it doesn’t render or supply any actual UI elements. You can build and design powerful datagrid experiences while retaining 100% control over markup and styles. The previous version i.e. v6 is a Table component where you don’t have 100% control over the table markup and styles. The latest version makes it easier to integrate into any existing theme or existing table markup. But for those who are using v6 and want to migrate to v7 this guide will help you to maintain the same styles and functionality.",
        "url": "https://levelup.gitconnected.com/migrating-react-table-from-v6-to-v7-dc840eb7ad7"
    },
    {
        "imageSrc": "s3/blog/images/formik.webp",
        "category": "React, Web Development",
        "date": "February 16, 2021",
        "title": "Upgrading Formik from v1 to v2",
        "description": "Formik is the most popular open-source form library for React and React Native that helps you with the 3 most annoying parts: Getting values in and out of form state, Validation and error messages and Handling form submission. It comes with battle-tested solutions for input validation, formatting, masking, arrays, and error handling. This means you spend less time writing form code and more time building your next big thing.",
        "url": "https://levelup.gitconnected.com/upgrading-formik-from-v1-to-v2-eea8d4442e10"
    },
    {
        "imageSrc": "s3/blog/images/sprite-anime.webp",
        "category": "Web Development",
        "date": "December 6, 2020",
        "title": "Three ways to animate sprite sheet image using CSS or JS",
        "description": "A sprite sheet is an image file containing several images or sprites. You can use it when building a game or animating a few layers. Combining the small images in one big image file not only improves the game performance but also reduces the memory usage and speeds up the startup time of the game. For this example we will use the following sprite sheet:",
        "url": "https://levelup.gitconnected.com/three-ways-to-animate-sprite-sheet-image-a5c000f0c579"
    },
    {
        "imageSrc": "s3/blog/images/react-ec2.webp",
        "category": "React, AWS",
        "date": "September 27, 2020",
        "title": "Deploying React application in Nginx server in AWS EC2",
        "description": "This tutorial will guide you to deploy a React web application in Nginx server in AWS EC2 using Bitbucket Pipelines. To get started you will require the following things: Bitbucket account (Free plan is okay), AWS Account, AWS EC2 instance with Nginx installed, SSH access to EC2 instance and Obviously, basic knowledge of Git",
        "url": "https://levelup.gitconnected.com/deploying-react-application-in-nginx-server-in-aws-ec2-6512ff71593b"
    },
    {
        "imageSrc": "s3/blog/images/batch-address.webp",
        "category": "React, Web Development",
        "date": "July 10, 2020",
        "title": "Batch Address Geocoding Using React and the Google Geocoding API",
        "description": "Geocoding is the process of converting addresses (like a street address) into geographic coordinates (like latitude and longitude), which you can use to place markers on a map or position the map. That means we need a full address like Anfield Rd, Anfield, Liverpool L4 0TH, United Kingdom to get the coordinates -53.4318476,-2.9609068.",
        "url": "https://betterprogramming.pub/batch-address-geocoding-using-react-and-the-google-geocoding-api-bec9ef4444f2"
    },
    {
        "imageSrc": "s3/blog/images/jigsaw.webp",
        "category": "JavaScript",
        "date": "June 3, 2020",
        "title": "Propeller game using JavaScript, HTML, and CSS",
        "description": "Creating games are so simple and everyone can do it. Let’s create an interactive game based on the “SAW” movie theme using JavaScript, HTML, and CSS. We won’t be using the canvas element to build the game. We will be using the Propeller JavaScript library. You can check my previous story to learn how to use the Propeller library.",
        "url": "https://levelup.gitconnected.com/saw-inspired-game-using-javascript-html-and-css-69ccc650d86c"
    },
    {
        "imageSrc": "s3/blog/images/rotate-elements.webp",
        "category": "JavaScript",
        "date": "June 11, 2020",
        "title": "Rotate Elements Using JavaScript",
        "description": "We will be using the Propeller JavaScript library to rotate elements. It supports inertia and stepwise rotation and is also compatible with touch devices. To rotate an element you can simply drag or swipe. Here is the demo of what we will make:",
        "url": "https://levelup.gitconnected.com/rotate-elements-using-javascript-db5e0bcd3927"
    },
    {
        "imageSrc": "s3/blog/images/react-pdf.webp",
        "category": "JavaScript, React",
        "date": "June 5, 2020",
        "title": "Displaying PDF in React app",
        "description": "I want to show you an easy and simple way to display PDF files using React in the browser. I will be using a library called react-pdf. This library is capable of rendering PDF files given an URL or a local file inside the project or base64 encoded version.",
        "url": "https://levelup.gitconnected.com/displaying-pdf-in-react-app-6e9d1fffa1a9"
    },
    {
        "imageSrc": "",
        "category": "JavaScript",
        "date": "June 3, 2020",
        "title": "What does Polymer.flush() do?",
        "description": "According to the documentation located here, it says that Polymer.flush() forces several classes of asynchronously queued tasks to flush. So, when you do dynamic changes that affect ShadyDOM distribution or perform some async operations (like insert, append, remove) or there are dynamic DOM changes (like upgrading elements and calling attached/detached), Polymer queues them and processes those changes.",
        "url": "https://medium.com/webisora/what-does-polymer-flush-do-edf09e6071a4"
    },
    {
        "imageSrc": "s3/blog/images/ssl-ec2.webp",
        "category": "AWS",
        "date": "May 31, 2020",
        "title": "How to install SSL certificate for Nginx server in Amazon Linux",
        "description": "This tutorial will help you to configure HTTPS to secure your website using a free SSL certificate authority (CA) letsencrypt for the nginx server in Amazon Linux. Before you begin you must have set up a domain name in your EC2 console to point to the public DNS. We will be using certbot and Amazon Linux AMI with the user name ec2-user.",
        "url": "https://sagar-shrestha.medium.com/how-to-install-ssl-certificate-for-nginx-server-in-amazon-linux-2986f51371fb"
    },
    {
        "imageSrc": "s3/blog/images/visual-code-https.gif",
        "category": "Visual Code",
        "date": "May 31, 2020",
        "title": "How to enable HTTPS on live server ( Visual Studio Code)",
        "description": "Live Server is one of my favorite Visual Code extensions which is used to launch a development local server with a live reload feature for static & dynamic pages. Yes, it supports dynamic pages like PHP.",
        "url": "https://medium.com/webisora/how-to-enable-https-on-live-server-visual-studio-code-5659fbc5542c"
    },
    {
        "imageSrc": "s3/blog/images/Yup-validate.webp",
        "category": "JavaScript",
        "date": "May 30, 2020",
        "title": "Yup: Validate if the values of two fields are the same",
        "description": "Yup is a JavaScript object schema validator and object parser. To check if the values of two fields are same or not using Yup, you can do: Yup.object().shape({ field1: Yup.string() .required('Required'), field2: Yup.string() .oneOf([Yup.ref('field1'), null], \"Does not match with",
        "url": "https://medium.com/swlh/implementing-mouse-scroll-in-slick-js-175b5025b79"
    },
    {
        "imageSrc": "s3/blog/images/implementing-mouse-scroll-in-slick-js.webp",
        "category": "JavaScript",
        "date": "May 30, 2020",
        "title": "Implementing mouse scroll in slick.js",
        "description": "Slick, the last carousel you’ll ever need, is a great image carousel for Javascript. Like every other carousel, you have a lot of additional functionality/features for your galleries like: Fully responsive. Scales",
        "url": "https://medium.com/swlh/implementing-mouse-scroll-in-slick-js-175b5025b79"
    }
]